[
  {
    "id": "prod-001",
    "slug": "cozy-cloud-throw-blanket",
    "name": "Cozy Cloud Throw Blanket",
    "category": "Home & Kitchen",
    "subCategory": "Bedding",
    "price": 39.99,
    "originalPrice": 59.99,
    "rating": 4.7,
    "ratingCount": 1842,
    "images": ["/images/sample-01.svg"],
    "description": "Cozy Cloud Throw Blanket is a soft, plush, all-season layer designed for couch lounging, nap-time, and movie nights. The microfiber weave keeps warmth in without overheating, while the breathable surface helps reduce static cling. The size is generous enough to share, yet light enough to toss in a carry bag for travel. Use it on a bed as an accent, on a chair as a texture boost, or as a comfort layer for quick afternoon resets. The fabric is gentle on skin, machine washable, and built to keep its loft after repeated cycles. This style pairs well with neutral rooms, warm tones, and minimalist spaces that need a soft pop. If you like weighted comfort without the heavy feel, this is the relaxing in-between option that stays cozy, tidy, and easy to maintain.",
    "affiliateUrl": "https://example.com/affiliate/blanket",
    "videoUrl": "https://www.youtube.com/watch?v=5qap5aO4i9A",
    "dealEndsAt": "2026-02-28T23:59:59Z"
  },
  {
    "id": "prod-002",
    "slug": "glow-breeze-mini-desk-fan",
    "name": "Glow Breeze Mini Desk Fan",
    "category": "Tech",
    "subCategory": "Home Office",
    "price": 24.5,
    "rating": 4.4,
    "ratingCount": 612,
    "images": ["/images/sample-02.svg"],
    "description": "Glow Breeze Mini Desk Fan delivers a quiet cooling stream for work desks, vanity spaces, and small bedside tables. The compact frame tucks neatly under shelves, while a multi-angle tilt lets you direct airflow without shifting your workspace. It uses a low-power motor for steady comfort and can run for long stretches without the high hum typical of bigger units. The styling leans clean and modern, making it a good fit for cozy rooms and minimalist setups. Use it as a light summer companion or a year-round airflow helper that keeps you comfortable while you focus. Setup takes seconds, and the simple control dial keeps it easy to use for anyone who prefers straightforward, no-fuss gear.",
    "affiliateUrl": "https://example.com/affiliate/fan"
  },
  {
    "id": "prod-003",
    "slug": "lunalift-collagen-matcha",
    "name": "LunaLift Collagen Matcha",
    "category": "Health & Fitness",
    "subCategory": "Wellness",
    "price": 28.0,
    "originalPrice": 36.0,
    "rating": 4.5,
    "ratingCount": 410,
    "images": ["/images/sample-03.svg"],
    "description": "LunaLift Collagen Matcha blends ceremonial-grade green tea with collagen peptides for a smooth, lightly sweet cup that fits into morning rituals. It dissolves easily in warm water or oat milk, creating a creamy texture without gritty residue. The flavor is mellow and balanced, making it a simple swap for sugary coffee drinks while still offering a gentle caffeine lift. For people who like structured wellness habits, this is an easy daily add-on because the scoop size is consistent and the taste is mild enough to mix into smoothies or latte blends. The jar is compact for countertop storage, and the lid seals tightly to keep the powder fresh between uses.",
    "affiliateUrl": "https://example.com/affiliate/matcha",
    "dealEndsAt": "2026-03-05T23:59:59Z"
  },
  {
    "id": "prod-004",
    "slug": "pet-haven-calming-bed",
    "name": "Pet Haven Calming Bed",
    "category": "Pets",
    "subCategory": "Sleep",
    "price": 49.99,
    "originalPrice": 64.99,
    "rating": 4.6,
    "ratingCount": 980,
    "images": ["/images/sample-04.svg"],
    "description": "Pet Haven Calming Bed is a plush donut-style lounger designed to give small and medium pets a cozy, secure nook. The raised rim offers head and neck support, while the center cushion stays soft enough for burrowing and nesting. A neutral tone makes it easy to blend into living rooms, bedrooms, or office corners without looking like a loud pet accessory. The cover is machine washable to keep things fresh, and the base includes a gentle non-slip backing so it stays put on hardwood or tile. If your pet likes to curl, stretch, or rest with a little structure, this bed keeps them settled and comfortable throughout the day.",
    "affiliateUrl": "https://example.com/affiliate/pet-bed",
    "dealEndsAt": "2026-03-12T23:59:59Z"
  },
  {
    "id": "prod-005",
    "slug": "aurora-led-vanity-mirror",
    "name": "Aurora LED Vanity Mirror",
    "category": "Beauty & Personal Care",
    "subCategory": "Skincare",
    "price": 89.0,
    "originalPrice": 109.0,
    "rating": 4.3,
    "ratingCount": 350,
    "images": ["/images/sample-05.svg"],
    "description": "Aurora LED Vanity Mirror brings bright, even lighting to everyday routines, from skincare to detailed makeup work. The light ring is designed to reduce harsh shadows, helping you see true tones and blend accurately. A slim profile keeps it elegant on counters, and the adjustable angle makes it easy to position at eye level. The touch controls are simple and responsive, so you can brighten or soften the glow depending on the time of day. This mirror feels premium without being oversized, making it a useful upgrade for anyone who likes a clean, organized vanity setup that still feels warm and inviting.",
    "affiliateUrl": "https://example.com/affiliate/vanity-mirror",
    "videoUrl": "https://www.youtube.com/watch?v=V-_O7nl0Ii0"
  },
  {
    "id": "prod-006",
    "slug": "trailnest-packable-hammock",
    "name": "TrailNest Packable Hammock",
    "category": "Outdoors & Sports",
    "subCategory": "Camping",
    "price": 32.0,
    "originalPrice": 48.0,
    "rating": 4.6,
    "ratingCount": 755,
    "images": ["/images/sample-06.svg"],
    "description": "TrailNest Packable Hammock is a lightweight outdoor essential for quick relax breaks, backyard hangs, or weekend camping. It packs down into a small pouch and clips easily to a backpack, making it ideal for day trips and spontaneous stops. The fabric is breathable yet supportive, and the seams are reinforced to handle steady use over time. Setup is straightforward with basic straps, and once it is up, the hammock holds its shape without sagging too much in the middle. If you enjoy slow outdoor moments, this gives you a comfortable place to unwind without adding much weight to your gear list.",
    "affiliateUrl": "https://example.com/affiliate/hammock",
    "dealEndsAt": "2026-03-08T23:59:59Z"
  },
  {
    "id": "prod-007",
    "slug": "steamfresh-handheld-steamer",
    "name": "SteamFresh Handheld Steamer",
    "category": "Home & Kitchen",
    "subCategory": "Laundry",
    "price": 46.0,
    "rating": 4.2,
    "ratingCount": 290,
    "images": ["/images/sample-07.svg"],
    "description": "SteamFresh Handheld Steamer is a compact, travel-friendly tool for smoothing wrinkles without setting up a full ironing board. The water tank heats quickly and delivers a consistent stream, making it easy to freshen shirts, dresses, or light upholstery in minutes. The handle sits comfortably in the hand, and the trigger is simple to operate, even for quick touchups before a meeting or event. It is light enough to store in a closet or take on a trip, while still delivering enough steam to make a visible difference on delicate fabrics. For everyday care, it keeps clothes looking crisp with minimal fuss.",
    "affiliateUrl": "https://example.com/affiliate/steamer"
  },
  {
    "id": "prod-008",
    "slug": "quietsip-thermal-tumbler",
    "name": "QuietSip Thermal Tumbler",
    "category": "Home & Kitchen",
    "subCategory": "Drinkware",
    "price": 21.99,
    "rating": 4.8,
    "ratingCount": 1200,
    "images": ["/images/sample-08.svg"],
    "description": "QuietSip Thermal Tumbler is built for long, steady sips on the go, with a smooth lid design that reduces spills and keeps drinks at a comfortable temperature. The double-wall insulation helps keep iced beverages cold and warm drinks cozy for hours, while the slim profile fits most cup holders. The finish feels soft in the hand and resists fingerprints, making it a clean-looking companion for desks, car rides, and errands. The lid seals tightly and cleans easily, so it works well for daily routines without extra upkeep. If you like a tidy, modern tumbler that looks good and performs, this is a strong pick.",
    "affiliateUrl": "https://example.com/affiliate/tumbler"
  },
  {
    "id": "prod-009",
    "slug": "pixeldock-wireless-charger",
    "name": "PixelDock Wireless Charger",
    "category": "Tech",
    "subCategory": "Accessories",
    "price": 29.99,
    "originalPrice": 39.99,
    "rating": 4.1,
    "ratingCount": 520,
    "images": ["/images/sample-09.svg"],
    "description": "PixelDock Wireless Charger keeps your phone upright and charging with a clean, minimal footprint. The stand angle is designed for easy glanceable notifications, and the base stays stable on desks or nightstands. It supports standard wireless charging speeds for most modern phones, and the soft-touch pad helps reduce sliding. The styling blends well with both tech-heavy and cozy setups, making it a subtle upgrade that keeps your surface uncluttered. If you charge frequently throughout the day, this offers a simple way to keep devices topped up while still looking tidy and intentional.",
    "affiliateUrl": "https://example.com/affiliate/charger",
    "dealEndsAt": "2026-03-15T23:59:59Z"
  },
  {
    "id": "prod-010",
    "slug": "flextone-pilates-ring",
    "name": "FlexTone Pilates Ring",
    "category": "Health & Fitness",
    "subCategory": "Pilates",
    "price": 18.5,
    "rating": 4.4,
    "ratingCount": 640,
    "images": ["/images/sample-10.svg"],
    "description": "FlexTone Pilates Ring is a lightweight resistance tool that adds gentle challenge to core and mobility workouts. The padded grips keep hands comfortable, while the ring provides steady tension for upper-body and inner-thigh routines. It is easy to store under a bed or slide into a closet, so it fits into small spaces without taking over your room. The resistance level is friendly for beginners yet still useful for slow, controlled movement sessions. If you want low-impact strength work that feels approachable, this ring helps build consistency without needing a full gym setup.",
    "affiliateUrl": "https://example.com/affiliate/pilates-ring"
  }
]
